<h2>Data Science Assignment No 1<h2>

In [1]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv("DSAssignment 1.csv")

In [5]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [6]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [7]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [10]:
df.shape

(10, 4)

In [11]:
m=df['Salary'].mean()

In [12]:
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [13]:
df.info

<bound method DataFrame.info of    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes>

In [14]:
df.size

40

In [15]:
df.ndim

2

In [16]:
df1=df["Purchased"].replace(["Yes", "No"],[1,0])

In [17]:
df["Purchased"]=df1

In [18]:
df

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

In [19]:
df1=df["Purchased"].astype(float)

In [20]:
df["Purchased"]=df1

In [21]:
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased    float64
dtype: object

In [22]:
df["Age"]=df["Age"].fillna(df["Age"].max())

In [23]:
df["Salary"]=df['Salary'].fillna(m)

In [24]:
df

   Country   Age        Salary  Purchased
0   France  44.0  72000.000000        0.0
1    Spain  27.0  48000.000000        1.0
2  Germany  30.0  54000.000000        0.0
3    Spain  38.0  61000.000000        0.0
4  Germany  40.0  63777.777778        1.0
5   France  35.0  58000.000000        1.0
6    Spain  50.0  52000.000000        0.0
7   France  48.0  79000.000000        1.0
8  Germany  50.0  83000.000000        0.0
9   France  37.0  67000.000000        1.0

In [25]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False   False      False
5    False  False   False      False
6    False  False   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [26]:
df["Age"]=df["Age"].astype(int)

In [27]:
df.dtypes

Country       object
Age            int32
Salary       float64
Purchased    float64
dtype: object

In [28]:
df

   Country  Age        Salary  Purchased
0   France   44  72000.000000        0.0
1    Spain   27  48000.000000        1.0
2  Germany   30  54000.000000        0.0
3    Spain   38  61000.000000        0.0
4  Germany   40  63777.777778        1.0
5   France   35  58000.000000        1.0
6    Spain   50  52000.000000        0.0
7   France   48  79000.000000        1.0
8  Germany   50  83000.000000        0.0
9   France   37  67000.000000        1.0

In [29]:
df

   Country  Age        Salary  Purchased
0   France   44  72000.000000        0.0
1    Spain   27  48000.000000        1.0
2  Germany   30  54000.000000        0.0
3    Spain   38  61000.000000        0.0
4  Germany   40  63777.777778        1.0
5   France   35  58000.000000        1.0
6    Spain   50  52000.000000        0.0
7   France   48  79000.000000        1.0
8  Germany   50  83000.000000        0.0
9   France   37  67000.000000        1.0

In [30]:
df.size

40

In [31]:
df.ndim

2

In [32]:
df.shape

(10, 4)